<!-- placeholder-1 -->
```fish
tofu plan -chdir=deployment/ -refresh=true
```
<!-- placeholder-2 -->

<details><summary>Diff of 2 changes.</summary>

```diff
+ aws_lightsail_container_service.microblog-flask-tutorial will be created
+ aws_lightsail_container_service_deployment_version.microblog-flask-tutorial-version will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 2 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @graydh at 2025-03-22T21:14:03Z [(view log)](https://github.com/graydh/microblog-flask-tutorial/actions/runs/14012413793/job/39233861545#step:5:1).
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_lightsail_container_service.microblog-flask-tutorial will be created
  + resource "aws_lightsail_container_service" "microblog-flask-tutorial" {
      + arn                 = (known after apply)
      + availability_zone   = (known after apply)
      + created_at          = (known after apply)
      + id                  = (known after apply)
      + is_disabled         = false
      + name                = "microblog-flask-tutorial"
      + power               = "micro"
      + power_id            = (known after apply)
      + principal_arn       = (known after apply)
      + private_domain_name = (known after apply)
      + resource_type       = (known after apply)
      + scale               = 1
      + state               = (known after apply)
      + tags_all            = (known after apply)
      + url                 = (known after apply)

      + private_registry_access (known after apply)

      + public_domain_names {
          + certificate {
              + certificate_name = "Certificate-1"
              + domain_names     = [
                  + "www.micro-blog.org",
                  + "micro-blog.org",
                ]
            }
        }
    }

  # aws_lightsail_container_service_deployment_version.microblog-flask-tutorial-version will be created
  + resource "aws_lightsail_container_service_deployment_version" "microblog-flask-tutorial-version" {
      + created_at   = (known after apply)
      + id           = (known after apply)
      + service_name = "microblog-flask-tutorial"
      + state        = (known after apply)
      + version      = (known after apply)

      + container {
          + command        = []
          + container_name = "microblog"
          + environment    = {
              + "DATABASE_URL"  = "postgresql://postgres:cZ9fj7ZfGttgWui3dt6f@microblog-postgres.c54gs806w0c6.us-east-1.rds.amazonaws.com:5432/microblog"
              + "MAIL_PASSWORD" = "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"
              + "MAIL_PORT"     = "587"
              + "MAIL_SERVER"   = "smtp.sendgrid.net"
              + "MAIL_USERNAME" = "apikey"
              + "MAIL_USE_TLS"  = "true"
              + "REDIS_URL"     = "redis://microblog-flask-tutorial.service.local:6379/0"
              + "SECRET_KEY"    = "f1c4e30f8c744b739e182ff6ed1b1ccf"
            }
          + image          = ":microblog-flask-tutorial.microblog.17"
          + ports          = {
              + "5000" = "HTTP"
            }
        }
      + container {
          + command        = []
          + container_name = "microblog-worker"
          + environment    = {
              + "DATABASE_URL"  = "postgresql://postgres:cZ9fj7ZfGttgWui3dt6f@microblog-postgres.c54gs806w0c6.us-east-1.rds.amazonaws.com:5432/microblog"
              + "MAIL_PASSWORD" = "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"
              + "MAIL_PORT"     = "587"
              + "MAIL_SERVER"   = "smtp.sendgrid.net"
              + "MAIL_USERNAME" = "apikey"
              + "MAIL_USE_TLS"  = "true"
              + "REDIS_URL"     = "redis://microblog-flask-tutorial.service.local:6379/0"
              + "SECRET_KEY"    = "f1c4e30f8c744b739e182ff6ed1b1ccf"
            }
          + image          = ":microblog-flask-tutorial.microblog-worker.19"
        }
      + container {
          + command        = []
          + container_name = "redis"
          + image          = "redis:7.4.1"
          + ports          = {
              + "6379" = "TCP"
            }
        }

      + public_endpoint {
          + container_name = "microblog"
          + container_port = 5000

          + health_check {
              + healthy_threshold   = 2
              + interval_seconds    = 5
              + path                = "/"
              + success_codes       = "200-499"
              + timeout_seconds     = 2
              + unhealthy_threshold = 2
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- tofu-33-1c414c45ca31c62e5bf0c010394c874d.tfplan -->
<!-- placeholder-6 -->